// Куча ли?

// Структуру данных «куча», или, более конкретно, «неубывающая пирамида», 
// можно реализовать на основе массива.

// Для этого должно выполнятся основное свойство неубывающей пирамиды, 
// которое заключается в том, что для каждого 1<=i<=n выполняются условия:

// если 2i<=n, то a[i]<=a[2i];
// если 2i+1<=n, то a[i]<=a[2i+1].
// Дан массив целых чисел. Определите, является ли он неубывающей пирамидой.

// Формат входного файла
// Первая строка входного файла содержит целое число n(1<=n<=10^6). Вторая строка 
// содержит  целых чисел, по модулю не превосходящих 2*10^9.

// Формат выходного файла
// Выведите «YES», если массив является неубывающей пирамидой, и «NO» в 
// противном случае.


#include <fstream>


int main()
{
    std::ifstream fin("input.txt");
    std::ofstream fout("output.txt");
    
    int n;
    fin >> n;
    int *array = new int [n + 1];
    
    for (int i = 1; i < n + 1; ++i)
        fin >> array[i];
    
    for (int i = 1; i < n + 1; ++i) {
        if (2 * i <= n && array[i] > array[2 * i]) {
            fout << "NO\n";
            return 0;
        } else if (2 * i + 1 <= n && array[i] > array[2 * i + 1]) {
            fout << "NO\n";
            return 0;
        }
    }
    
    fout << "YES\n";
    
    delete [] array;
    
    return 0;
}
