// Задача «a+b^2»

// В данной задаче требуется вычислить значение выражения a+b^2.

// Формат входного файла
// Входной файл состоит из одной строки, которая содержит два целых числа a и b. 
// Для этих чисел выполняются условия -10^9<=a<=10^9, -10^9<=b<=10^9.

// Формат выходного файла
// В выходной файл выведите единственное целое число — результат вычисления выражения a+b^2.


#include <fstream>


int main()
{
    std::ifstream fin("input.txt");
    std::ofstream fout("output.txt");
    
    long long a, b = 0;
    fin >> a >> b;
    fout << a + b * b << std::endl;
    
    return 0;
}
