// Задача «a+b»

// В данной задаче требуется вычислить сумму двух заданных чисел.

// Формат входного файла
// Входной файл состоит из одной строки, которая содержит два целых числа a и b. 
// Для этих чисел выполняются условия -10^9<=a<=10^9, -10^9<=b<=10^9.

// Формат выходного файла
// В выходной файл выведите единственное целое число — результат сложения a+b.


#include <fstream>


int main()
{
    std::ifstream fin("input.txt");
    std::ofstream fout("output.txt");
    
    int a, b = 0;
    fin >> a >> b;
    fout << a + b << std::endl;
    
    return 0;
}
